import React from "react";
import SectionTitle from "../../../components/common/SectionTitle";
import Like from "../../../components/common/Like";

function CourseDetailDesc() {
  return (
    <div className="course-detail-desc p-[30px] w-[1000px] rounded-[30px] bg-[rgba(255,255,255,1)] mb-[20px]">
      <div className="course-detail-title flex flex-row flex-nowrap justify-between mb-[30px]">
        <Like />
        <SectionTitle title="عنوان دوره" customClass="text-end" />
      </div>
      <p className="text-end">
        لورم ایپسوم محبوب ترین و استانداردترین متن ساختگی است که توسط توسعه
        دهندگان وب، تایپوگراف ها و طراحان استفاده می شود. تکه های لاتین متن نشان
        می دهد که یک پروژه در حال توسعه است. لورم ایپسوم فقط برای توسعه دهندگان
        وب نیست. طراحان گرافیک نیز از آن با نرم افزارهای مختلفی مانند فوتوشاپ
        استفاده می کنند. لورم ایپسوم محبوب ترین و استانداردترین متن ساختگی است
        که توسط توسعه دهندگان وب، تایپوگراف ها و طراحان استفاده می شود. تکه های
        لاتین متن نشان می دهد که یک پروژه در حال توسعه است. لورم ایپسوم فقط برای
        توسعه دهندگان وب نیست. طراحان گرافیک نیز از آن با نرم افزارهای مختلفی
        مانند فوتوشاپ استفاده می کنند. لورم ایپسوم محبوب ترین و استانداردترین
        متن ساختگی است که توسط توسعه دهندگان وب، تایپوگراف ها و طراحان استفاده
        می شود. تکه های لاتین متن نشان می دهد که یک پروژه در حال توسعه است. لورم
        ایپسوم فقط برای توسعه دهندگان وب نیست. طراحان گرافیک نیز از آن با نرم
        افزارهای مختلفی مانند فوتوشاپ استفاده می کنند. لورم ایپسوم محبوب ترین و
        استانداردترین متن ساختگی است که توسط توسعه دهندگان وب، تایپوگراف ها و
        طراحان استفاده می شود. تکه های لاتین متن نشان می دهد که یک پروژه در حال
        توسعه است. لورم ایپسوم فقط برای توسعه دهندگان وب نیست. طراحان گرافیک نیز
        از آن با نرم افزارهای مختلفی مانند فوتوشاپ استفاده می کنند. لورم ایپسوم
        محبوب ترین و استانداردترین متن ساختگی است که توسط توسعه دهندگان وب،
        تایپوگراف ها و طراحان استفاده می شود. تکه های لاتین متن نشان می دهد که
        یک پروژه در حال توسعه است. لورم ایپسوم فقط برای توسعه دهندگان وب نیست.
        طراحان گرافیک نیز از آن با نرم افزارهای مختلفی مانند فوتوشاپ استفاده می
        کنند. لورم ایپسوم محبوب ترین و استانداردترین متن ساختگی است که توسط
        توسعه دهندگان وب، تایپوگراف ها و طراحان استفاده می شود. تکه های لاتین
        متن نشان می دهد که یک پروژه در حال توسعه است. لورم ایپسوم فقط برای توسعه
        دهندگان وب نیست. طراحان گرافیک نیز از آن با نرم افزارهای مختلفی مانند
        فوتوشاپ استفاده می کنند.
      </p>
    </div>
  );
}

export default CourseDetailDesc;
